import {Excel} from '/templates/excel_show.mjs';

const $spreadsheet = document.querySelector('#spreadsheet')
const $spreadsheet2 = document.querySelector('#spreadsheet2')

let excel_data = [{ "저장시간": "202206071700", "농가명": "차*수(토마토)", "구역": "1", "제어온도": 21.5, "내부온도1": 21, "내부온도2": 21.9, "내부온도3": 0, "제어습도": 84.6, "내부습도1": 87.4, "내부습도2": 81.7, "내부습도3": 0, "지온": 0, "지습": 0, "순환온도(3WAY1)": 19.6, "이슬점": 18.8, "CO2농도": 294.9, "외부온도": 20.2, "풍속": 1.3, "일사량": 6.3, "누적일사량": 1025.3, "감우": 7250, "제어환기온도": 17.8, "제어난방온도": 12.9, "상대습도(포화수분)": 18.6, "절대습도": 16.3, "수분부족분": 2.3, "이중창환기온도": 17.3, "CO2설정값": 0, "환기조절": 3, "난방조절": 0.1, "천창좌개도": 0, "천창우개도": 0, "이중창좌개도": 100, "이중창우개도": 100, "측창좌개도": 0, "측창우개도": 0, "커튼상개도": 100, "커튼하개도": 100, "측커튼개도": 100, "외부커튼개도": 0, "3WAY밸브1개도": 0, "3WAY밸브2개도": 0 }, { "저장시간": "202206071800", "농가명": "차*수(토마토)", "구역": "1", "제어온도": 20.9, "내부온도1": 20.5, "내부온도2": 21.3, "내부온도3": 0, "제어습도": 88.2, "내부습도1": 91.4, "내부습도2": 85.1, "내부습도3": 0, "지온": 0, "지습": 0, "순환온도(3WAY1)": 19.5, "이슬점": 19, "CO2농도": 305.8, "외부온도": 18.6, "풍속": 1.3, "일사량": 5.6, "누적일사량": 1027.4, "감우": 6833.3, "제어환기온도": 17, "제어난방온도": 12.5, "상대습도(포화수분)": 18, "절대습도": 16.5, "수분부족분": 1.6, "이중창환기온도": 16.5, "CO2설정값": 0, "환기조절": 2.7, "난방조절": 0.5, "천창좌개도": 8.1, "천창우개도": 0, "이중창좌개도": 100, "이중창우개도": 100, "측창좌개도": 0, "측창우개도": 0, "커튼상개도": 100, "커튼하개도": 100, "측커튼개도": 100, "외부커튼개도": 0, "3WAY밸브1개도": 0, "3WAY밸브2개도": 0 }, { "저장시간": "202206071900", "농가명": "차*수(토마토)", "구역": "1", "제어온도": 20.2, "내부온도1": 19.8, "내부온도2": 20.5, "내부온도3": 0, "제어습도": 90.1, "내부습도1": 92.8, "내부습도2": 87.4, "내부습도3": 0, "지온": 0, "지습": 0, "순환온도(3WAY1)": 19, "이슬점": 18.6, "CO2농도": 316.7, "외부온도": 17.3, "풍속": 0.7, "일사량": 0, "누적일사량": 1028, "감우": 10000, "제어환기온도": 17, "제어난방온도": 12.5, "상대습도(포화수분)": 17.3, "절대습도": 16.1, "수분부족분": 1.2, "이중창환기온도": 16.5, "CO2설정값": 0, "환기조절": 2, "난방조절": 0.5, "천창좌개도": 0, "천창우개도": 0, "이중창좌개도": 100, "이중창우개도": 100, "측창좌개도": 0, "측창우개도": 0, "커튼상개도": 100, "커튼하개도": 100, "측커튼개도": 100, "외부커튼개도": 0, "3WAY밸브1개도": 0, "3WAY밸브2개도": 0 }, { "저장시간": "202206072000", "농가명": "차*수(토마토)", "구역": "1", "제어온도": 19.6, "내부온도1": 19.3, "내부온도2": 19.9, "내부온도3": 0, "제어습도": 92.2, "내부습도1": 95, "내부습도2": 89.4, "내부습도3": 0, "지온": 0, "지습": 0, "순환온도(3WAY1)": 18.7, "이슬점": 18.4, "CO2농도": 342.2, "외부온도": 16.8, "풍속": 1.5, "일사량": 0, "누적일사량": 1028, "감우": 10000, "제어환기온도": 15.4, "제어난방온도": 12.5, "상대습도(포화수분)": 16.8, "절대습도": 15.9, "수분부족분": 0.9, "이중창환기온도": 14.9, "CO2설정값": 0, "환기조절": -0.7, "난방조절": 0.5, "천창좌개도": 0, "천창우개도": 0, "이중창좌개도": 100, "이중창우개도": 100, "측창좌개도": 0, "측창우개도": 0, "커튼상개도": 100, "커튼하개도": 100, "측커튼개도": 100, "외부커튼개도": 0, "3WAY밸브1개도": 0, "3WAY밸브2개도": 0 }, { "저장시간": "202206072100", "농가명": "차*수(토마토)", "구역": "1", "제어온도": 19.3, "내부온도1": 19.1, "내부온도2": 19.5, "내부온도3": 0, "제어습도": 92.5, "내부습도1": 95, "내부습도2": 90, "내부습도3": 0, "지온": 0, "지습": 0, "순환온도(3WAY1)": 18.6, "이슬점": 18.2, "CO2농도": 356.4, "외부온도": 17.1, "풍속": 2.8, "일사량": 0, "누적일사량": 1028, "감우": 9666.7, "제어환기온도": 15, "제어난방온도": 12.5, "상대습도(포화수분)": 16.6, "절대습도": 15.7, "수분부족분": 0.9, "이중창환기온도": 14.5, "CO2설정값": 0, "환기조절": -0.8, "난방조절": 0.5, "천창좌개도": 0, "천창우개도": 0.2, "이중창좌개도": 100, "이중창우개도": 100, "측창좌개도": 0, "측창우개도": 0, "커튼상개도": 100, "커튼하개도": 100, "측커튼개도": 100, "외부커튼개도": 0, "3WAY밸브1개도": 0, "3WAY밸브2개도": 0 }, { "저장시간": "202206072200", "농가명": "차*수(토마토)", "구역": "1", "제어온도": 19.1, "내부온도1": 19, "내부온도2": 19.2, "내부온도3": 0, "제어습도": 92.9, "내부습도1": 95.2, "내부습도2": 90.6, "내부습도3": 0, "지온": 0, "지습": 0, "순환온도(3WAY1)": 18.4, "이슬점": 18.1, "CO2농도": 359.4, "외부온도": 17.1, "풍속": 3, "일사량": 0, "누적일사량": 1028, "감우": 9242.4, "제어환기온도": 15, "제어난방온도": 12.5, "상대습도(포화수분)": 16.4, "절대습도": 15.6, "수분부족분": 0.8, "이중창환기온도": 14.5, "CO2설정값": 0, "환기조절": -0.8, "난방조절": 0.5, "천창좌개도": 0, "천창우개도": 0.4, "이중창좌개도": 100, "이중창우개도": 100, "측창좌개도": 0, "측창우개도": 0, "커튼상개도": 100, "커튼하개도": 100, "측커튼개도": 100, "외부커튼개도": 0, "3WAY밸브1개도": 0, "3WAY밸브2개도": 0 }, { "저장시간": "202206080000", "농가명": "차*수(토마토)", "구역": "1", "제어온도": 18.7, "내부온도1": 18.6, "내부온도2": 18.8, "내부온도3": 0, "제어습도": 93.6, "내부습도1": 95.8, "내부습도2": 91.4, "내부습도3": 0, "지온": 0, "지습": 0, "순환온도(3WAY1)": 18.2, "이슬점": 17.9, "CO2농도": 346.9, "외부온도": 16.9, "풍속": 2.5, "일사량": 0, "누적일사량": 1028, "감우": 9545.5, "제어환기온도": 15, "제어난방온도": 12.4, "상대습도(포화수분)": 16, "절대습도": 15.4, "수분부족분": 0.7, "이중창환기온도": 14.5, "CO2설정값": 0, "환기조절": -0.9, "난방조절": 0.5, "천창좌개도": 0, "천창우개도": 1.6, "이중창좌개도": 100, "이중창우개도": 100, "측창좌개도": 0, "측창우개도": 0, "커튼상개도": 100, "커튼하개도": 100, "측커튼개도": 100, "외부커튼개도": 0, "3WAY밸브1개도": 0, "3WAY밸브2개도": 0 }, { "저장시간": "202206080100", "농가명": "차*수(토마토)", "구역": "1", "제어온도": 18.6, "내부온도1": 18.5, "내부온도2": 18.7, "내부온도3": 0, "제어습도": 94.3, "내부습도1": 96.6, "내부습도2": 92.1, "내부습도3": 0, "지온": 0, "지습": 0, "순환온도(3WAY1)": 18.2, "이슬점": 17.9, "CO2농도": 362.3, "외부온도": 16.7, "풍속": 2.3, "일사량": 0, "누적일사량": 1028, "감우": 10000, "제어환기온도": 15, "제어난방온도": 12.5, "상대습도(포화수분)": 15.9, "절대습도": 15.4, "수분부족분": 0.5, "이중창환기온도": 14.5, "CO2설정값": 0, "환기조절": -0.9, "난방조절": 0.5, "천창좌개도": 0, "천창우개도": 0, "이중창좌개도": 100, "이중창우개도": 100, "측창좌개도": 0, "측창우개도": 0, "커튼상개도": 100, "커튼하개도": 100, "측커튼개도": 100, "외부커튼개도": 0, "3WAY밸브1개도": 0, "3WAY밸브2개도": 0 }, { "저장시간": "202206080200", "농가명": "차*수(토마토)", "구역": "1", "제어온도": 18.5, "내부온도1": 18.4, "내부온도2": 18.6, "내부온도3": 0, "제어습도": 94.8, "내부습도1": 97.1, "내부습도2": 92.4, "내부습도3": 0, "지온": 0, "지습": 0, "순환온도(3WAY1)": 18.1, "이슬점": 17.9, "CO2농도": 376.4, "외부온도": 16.6, "풍속": 1.7, "일사량": 0, "누적일사량": 1028, "감우": 10000, "제어환기온도": 15, "제어난방온도": 12.5, "상대습도(포화수분)": 15.8, "절대습도": 15.4, "수분부족분": 0.4, "이중창환기온도": 14.5, "CO2설정값": 0, "환기조절": -1, "난방조절": 0.5, "천창좌개도": 0, "천창우개도": 0, "이중창좌개도": 100, "이중창우개도": 100, "측창좌개도": 0, "측창우개도": 0, "커튼상개도": 100, "커튼하개도": 100, "측커튼개도": 100, "외부커튼개도": 0, "3WAY밸브1개도": 0, "3WAY밸브2개도": 0 }, { "저장시간": "202206080300", "농가명": "차*수(토마토)", "구역": "1", "제어온도": 18.4, "내부온도1": 18.3, "내부온도2": 18.5, "내부온도3": 0, "제어습도": 95, "내부습도1": 97.2, "내부습도2": 92.8, "내부습도3": 0, "지온": 0, "지습": 0, "순환온도(3WAY1)": 18, "이슬점": 17.8, "CO2농도": 382, "외부온도": 16.5, "풍속": 1.6, "일사량": 0, "누적일사량": 1028, "감우": 7981.5, "제어환기온도": 15, "제어난방온도": 12.6, "상대습도(포화수분)": 15.7, "절대습도": 15.3, "수분부족분": 0.4, "이중창환기온도": 14.5, "CO2설정값": 0, "환기조절": -1, "난방조절": 0.5, "천창좌개도": 0, "천창우개도": 6.3, "이중창좌개도": 100, "이중창우개도": 100, "측창좌개도": 0, "측창우개도": 0, "커튼상개도": 100, "커튼하개도": 100, "측커튼개도": 100, "외부커튼개도": 0, "3WAY밸브1개도": 0, "3WAY밸브2개도": 0 }, { "저장시간": "202206080400", "농가명": "차*수(토마토)", "구역": "1", "제어온도": 17.9, "내부온도1": 17.7, "내부온도2": 18, "내부온도3": 0, "제어습도": 94.5, "내부습도1": 96.5, "내부습도2": 92.4, "내부습도3": 0, "지온": 0, "지습": 0, "순환온도(3WAY1)": 17.3, "이슬점": 17.1, "CO2농도": 331, "외부온도": 16.5, "풍속": 2, "일사량": 0, "누적일사량": 1028, "감우": 3333.3, "제어환기온도": 15.4, "제어난방온도": 13.4, "상대습도(포화수분)": 15.2, "절대습도": 14.6, "수분부족분": 0.5, "이중창환기온도": 14.9, "CO2설정값": 0, "환기조절": -0.5, "난방조절": 0.5, "천창좌개도": 0, "천창우개도": 28.3, "이중창좌개도": 100, "이중창우개도": 100, "측창좌개도": 0, "측창우개도": 0, "커튼상개도": 100, "커튼하개도": 100, "측커튼개도": 100, "외부커튼개도": 0, "3WAY밸브1개도": 0, "3WAY밸브2개도": 0 }];
let excel_data2 = [{출하일자: '2020-11-03', 출하량: 2080.8},{출하일자: '2020-11-10', 출하량: 346.7999999999997},{출하일자: '2020-11-18', 출하량: 2080.8000000000006},{출하일자: '2020-11-24', 출하량: 2080.7999999999993},{출하일자: '2020-12-01', 출하량: 2774.3999999999987},{출하일자: '2020-12-08', 출하량: 1040.3999999999996},{출하일자: '2020-12-15', 출하량: 3121.2000000000007},{출하일자: '2020-12-21', 출하량: 1387.199999999999},{출하일자: '2020-12-28', 출하량: 1040.4000000000033},{출하일자: '2021-01-06', 출하량: 2427.5999999999967},{출하일자: '2021-01-12', 출하량: 346.7999999999993}]

let data1 = new Excel(excel_data, $spreadsheet);
let data2 = new Excel(excel_data2, $spreadsheet2);

const $var1 = document.querySelector('#var1');
const $var2 = document.querySelector('#var2');

// Object.keys(data1.getData()[0])[i]
function makeSelectBox() {
    for(let x of Object.keys(data1.getData()[0])){
        $var1.innerHTML += `<Option value= '${x}'>` + x + `</option>`;
    }
    for(let x of Object.keys(data2.getData()[0])){
        $var2.innerHTML += `<Option value= '${x}'>` + x + `</option>`;
    }
}

makeSelectBox(); // selectedBox 데이터 추가

const $merge_button =document.querySelector('#merge_button');
let var1_text=$var1.childNodes[1].textContent;
let var2_text=$var2.childNodes[1].textContent;
let newData; // 병합된 데이터
let isData = false; // 새로운 데이터가 만들어지면 download 버튼 클릭 가능
$var1.addEventListener('click', (event) =>{
    var1_text = event.target.value;
})
$var2.addEventListener('click', (event) =>{
    var2_text = event.target.value
})

$merge_button.addEventListener('click', () => {
    alert(`${var1_text}과 ${var2_text}를 기준으로 병합합니다.`)
    // ajax로 성공시 밑 실행
    // isData=true;
    // if(isData){
    //     document.querySelector('#download').disabled = false;
    // }
})

